using System.Collections.Generic;
using static Kyiv.Конвертер;

namespace Kyiv;

public class Декомпілятор
{
    public static string Декомпілювати(string команда)
    {
        var лістінг = ПарсерЛістінга.ПрочитатиІзРядка(команда);
        return Декомпілювати(лістінг);
    }

    public static string Декомпілювати(Лістінг лістінг)
    {
        List<string> команди = new List<string>();
        foreach (var (лінія, адреса) in лістінг.ОдиниціКоду.SelectMany(ок => ок.Команди.Select((к, а) => (к, ок.ПочатковаАдреса + а))))
        {
            try
            {
                команди.AddRange(new string[] { $"lbl_{До8РічноїАдреси(адреса)}:" }.Union(
                    ДоАссемблера(ПарсерКоманд.Розібрати(лінія), true).Select(ДоРядка)));
            }
            catch
            {
                команди.Add("// Невідома команда " + ПарсерКоманд.Сконвертувати(лінія));
            }
        }

        return string.Join(Environment.NewLine, команди);
    }
    private static string ДоРядка(Операція операція)
    {
        return string.Join(Environment.NewLine, операція.ToString().ReplaceLineEndings().Split(Environment.NewLine).Select(x => "    " + x));
    }

    private static IEnumerable<Операція> ДоАссемблера(СтруктураКоманди команда, bool html)
    {
        switch (команда.Код)
        {
            case КодОперації.Сложение:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.Додавання, команда);
                break;
            case КодОперації.Вычитание:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.Віднімання, команда);
                break;
            case КодОперації.СложениеКоманд:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.ДодаванняКоманд, команда);
                break;
            case КодОперації.СравнениеСУчетомЗнаков:
                yield return new УмовнаОперація(
                    new БінарнаОперація(ТипБінарноїОперації.МеншеЧиДорівнює,
                        ВідноснаПамять(команда.Адреса1),
                        ВідноснаПамять(команда.Адреса2)),
                    new Перехід(команда.Адреса3));
                break;
            case КодОперації.СравнениеБезУчетаЗнаков:
                yield return new УмовнаОперація(
                    new БінарнаОперація(ТипБінарноїОперації.МеншеЧиДорівнює,
                        new УнарнаОперація(ТипУнарноїОперації.Модуль, ВідноснаПамять(команда.Адреса1)),
                        new УнарнаОперація(ТипУнарноїОперації.Модуль, ВідноснаПамять(команда.Адреса2))),
                    new Перехід(команда.Адреса3));
                break;
            case КодОперації.ВычитаниеПоМодулю:
                yield return new ЗберіганняЗмінної(
                    ВідноснаПамять(команда.Адреса3),
                    new БінарнаОперація(ТипБінарноїОперації.Віднімання,
                        new УнарнаОперація(ТипУнарноїОперації.Модуль, ВідноснаПамять(команда.Адреса1)),
                        new УнарнаОперація(ТипУнарноїОперації.Модуль, ВідноснаПамять(команда.Адреса2))));
                break;

            case КодОперації.УмножениеБезОкругления:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.МноженняБезСкругленням, команда);
                break;
            case КодОперації.УмножениеСОкруглением:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.Множення, команда);
                break;
            case КодОперації.Деление:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.Ділення, команда);
                break;
            case КодОперації.ЛогическийСдвиг:
                yield return new УмовнаОперація2(
                    new БінарнаОперація(ТипБінарноїОперації.МеншеЧиДорівнює,
                        ВідноснаПамять(команда.Адреса1),
                        new Константа(0)),
                    new ЗберіганняЗмінної(
                        ВідноснаПамять(команда.Адреса3),
                        new БінарнаОперація(ТипБінарноїОперації.СдвигВправо, ВідноснаПамять(команда.Адреса1), new УнарнаОперація(ТипУнарноїОперації.Модуль, ВідноснаПамять(команда.Адреса2)))),
                    new ЗберіганняЗмінної(
                        ВідноснаПамять(команда.Адреса3),
                        new БінарнаОперація(ТипБінарноїОперації.СдвигВліво, ВідноснаПамять(команда.Адреса1), ВідноснаПамять(команда.Адреса2))));
                break;
            case КодОперації.ЛогическоеСложение:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.ЛогічнеДодавання, команда);
                break;
            case КодОперації.ЛогическоеУмножение:
                yield return СтворитиБінарнуОперацію(ТипБінарноїОперації.ЛогічнеМноження, команда);
                break;

            case КодОперації.ВыводКодов:
                yield return new ВивідКодів(команда.Адреса1, команда.Адреса2);
                yield return new Перехід(команда.Адреса3);
                break;

            case КодОперації.НачалоГрупповойОперации:
                yield return new ЗберіганняЗмінної(
                    new Регістр(ТипРегістра.Ц),
                    ВідноснаАдреса(команда.Адреса1));
                yield return new ЗберіганняЗмінної(
                    new Регістр(ТипРегістра.А),
                    ВідноснаАдреса(команда.Адреса2));
                yield return new УмовнаОперація(
                    new БінарнаОперація(ТипБінарноїОперації.Дорівнює, new Регістр(ТипРегістра.Ц), new Регістр(ТипРегістра.А)),
                    new Перехід(команда.Адреса3));
                break;
            case КодОперації.ОкончаниеГрупповойОперации:
                yield return new ЗберіганняЗмінної(
                    new Регістр(ТипРегістра.А),
                    new БінарнаОперація(ТипБінарноїОперації.Додавання, new Регістр(ТипРегістра.А), ВідноснаПамять(команда.Адреса1)));
                yield return new УмовнаОперація(
                    new БінарнаОперація(ТипБінарноїОперації.Дорівнює, new Регістр(ТипРегістра.Ц), new Регістр(ТипРегістра.А)),
                    new Перехід(команда.Адреса3));
                yield return new Перехід(команда.Адреса2);
                break;

            case КодОперації.УсловныйПереходПоЗнакуЧисла:
                yield return new УмовнаОперація(
                    new БінарнаОперація(ТипБінарноїОперації.МеншеЧиДорівнює,
                        ВідноснаПамять(команда.Адреса1),
                        new Константа(0)),
                    new Перехід(команда.Адреса3));
                yield return new Перехід(команда.Адреса2);
                break;
            case КодОперації.ПереходПоРегиструВозврата:
                yield return new Повернутися();
                break;
            //case КодОперації.ОстановМашины:
            //case КодОперації.ПереходПоРегиструВозврата:
            //    return команда.Код.ToString();
            //case КодОперації.ПереходПоФиксатору:
            //    return $"{команда.Код} {Адреса(команда.Адреса1, html)}, {Адреса(команда.Адреса3, html)}";
            //case КодОперації.НачалоГрупповойОперации:
            //    return $"{команда.Код} {ВідноснаАдреса(команда.Адреса1)}, {ВідноснаАдреса(команда.Адреса2)}, {Адреса(команда.Адреса3, html)}";
            default:
                throw new NotSupportedException();
        }
    }

    private static Операція СтворитиБінарнуОперацію(ТипБінарноїОперації тип, СтруктураКоманди команда)
    {
        return new ЗберіганняЗмінної(
            ВідноснаПамять(команда.Адреса3),
            new БінарнаОперація(тип, ВідноснаПамять(команда.Адреса1), ВідноснаПамять(команда.Адреса2)));
    }

    private static Вираз ВідноснаАдреса(int адреса)
    {
        var базоваАдреса = адреса & 0x7FF;
        if ((адреса & (1 << 11)) != 0)
        {
            return new БінарнаОперація(ТипБінарноїОперації.Додавання, new Константа(базоваАдреса), new Регістр(ТипРегістра.А));
        }

        return new Константа(базоваАдреса);
    }

    private static Вираз ВідноснаПамять(int адреса)
    {
        return new АдресаПамяти(ВідноснаАдреса(адреса));
    }
}

abstract record Операція();
abstract record Вираз();
enum ТипУнарноїОперації
{
    Модуль,
}
record УнарнаОперація(ТипУнарноїОперації Тип, Вираз Вираз) : Вираз
{
    public override string ToString()
    {
        switch (Тип)
        {
            case ТипУнарноїОперації.Модуль:
                return $"|{Вираз}|";
        default:
                throw new NotImplementedException($"Невідомий тип унарної операції {Тип}");
    }
}
}
enum ТипБінарноїОперації
{
    Додавання,
    Віднімання,
    Множення,
    Ділення,
    ДодаванняКоманд,
    МноженняБезСкругленням,

    Дорівнює,
    МеншеЧиДорівнює,

    ЛогічнеДодавання,
    ЛогічнеМноження,
    СдвигВправо,
    СдвигВліво,
}
record БінарнаОперація(ТипБінарноїОперації Тип, Вираз Вираз1, Вираз Вираз2): Вираз
{
    public override string ToString()
    {
        return $"{Вираз1} {ТипОперації()} {Вираз2}";
    }

    private string ТипОперації()
    {
        switch(Тип)
        {
            case ТипБінарноїОперації.Додавання:
                return "+";
            case ТипБінарноїОперації.Віднімання:
                return "-";
            case ТипБінарноїОперації.Множення:
                return "*";
            case ТипБінарноїОперації.Ділення:
                return "/";
            case ТипБінарноїОперації.МноженняБезСкругленням:
                return "|*|";
            case ТипБінарноїОперації.ДодаванняКоманд:
                return "ДодК";

            case ТипБінарноїОперації.Дорівнює:
                return "==";
            case ТипБінарноїОперації.МеншеЧиДорівнює:
                return "<=";

            case ТипБінарноїОперації.ЛогічнеДодавання:
                return "|";
            case ТипБінарноїОперації.ЛогічнеМноження:
                return "&";

            case ТипБінарноїОперації.СдвигВліво:
                return "<<";
            case ТипБінарноїОперації.СдвигВправо:
                return ">>";
            default:
                throw new NotImplementedException($"Невідомий тип бінарної операції {Тип}");
        }
    }
};
record ЗберіганняЗмінної(Вираз МісцеЗберігання, Вираз Що) : Операція
{
    public override string ToString()
    {
        return $"{МісцеЗберігання} = {Що};";
    }
};
record УмовнаОперація(Вираз Умова, Операція Що) : Операція
{
    public override string ToString()
    {
        return $"if ({Умова})\n{{\n    {Що}\n}}";
    }
};
record УмовнаОперація2(Вираз Умова, Операція Що, Операція Інакше) : Операція
{
    public override string ToString()
    {
        return $"if ({Умова})\n{{\n    {Що}\n}}\nelse{{\n   {Інакше}\n}}";
    }
};
record Перехід(int адреса) : Операція
{
    public override string ToString()
    {
        return $"goto lbl_{До8РічноїАдреси(адреса)};";
    }
}
record Повернутися() : Операція
{
    public override string ToString()
    {
        return $"lngjmp;";
    }
};
record ВстановитиТочкуПовернення(int адреса) : Операція
{
    public override string ToString()
    {
        return $"setjmp {До8РічноїАдреси(адреса)};";
    }
}

record Константа(int значення) : Вираз
{
    public override string ToString()
    {
        return $"{До8РічноїАдреси(значення)}";
    }
};
record АдресаПамяти(Вираз адреса) : Вираз
{
    public override string ToString()
    {
        return $"var_{адреса}";
    }
};
enum ТипРегістра
{
    С,
    К,
    Р,
    Ц,
    А,
}
record Регістр(ТипРегістра регістр) : Вираз
{
    public override string ToString()
    {
        return регістр.ToString();
    }
};

record ВивідКодів(int від, int по) : Операція
{
    public override string ToString()
    {
        return $"printCodes({До8РічноїАдреси(від)}, {До8РічноїАдреси(по)})";
    }
};