namespace Kyiv;

public static class Конвертер
{
    public static int До8РічноїАдреси(int ячейка) => (ячейка / (8 * 8 * 8)) * 1000 + (ячейка % (8 * 8 * 8) / (8 * 8)) * 100 + (ячейка % (8 * 8) / 8) * 10 + ячейка % 8;

    public static int Із8РічноїАдреси(int ячейка) => (ячейка / 1000) * 8 * 8 * 8 + (ячейка % 1000 / 100) * 8 * 8 + (ячейка % 100 / 10) * 8 + ячейка % 10;

    public static double ДоДвойноїТочності(ulong значення)
    {
        var єзнак = МашинаКиїв.ЄЗнак(значення);
        var мантіса = (0x3FF0UL << 48) + (МашинаКиїв.Модуль(значення) << (52-40));
        return (єзнак ? -1 : 1) * (BitConverter.UInt64BitsToDouble(мантіса) - 1.0);
    }
}
