namespace Kyiv;

public static class ПарсерКоманд
{
    public static СтруктураКоманди Розібрати(string команда)
    {
        команда = команда.Replace(" ", "").Replace("\t", "");
        var код = Розібрати8Річні(команда.AsSpan()[0..2]);
        var адреса1 = Розібрати8Річні(команда.AsSpan()[2..6]);
        var адреса2 = Розібрати8Річні(команда.AsSpan()[6..10]);
        var адреса3 = Розібрати8Річні(команда.AsSpan()[10..14]);
        return new((КодОперації)код, адреса1, адреса2, адреса3);
    }
    public static ulong Сконвертувати(string команда)
    {
        команда = команда.Replace(" ", "").Replace("\t", "");
        var код = (ulong)Розібрати8Річні(команда.AsSpan()[0..2]);
        var адреса1 = (ulong)Розібрати8Річні(команда.AsSpan()[2..6]);
        var адреса2 = (ulong)Розібрати8Річні(команда.AsSpan()[6..10]);
        var адреса3 = (ulong)Розібрати8Річні(команда.AsSpan()[10..14]);
        return адреса3 + (адреса2 << 12) + (адреса1 << 24) + (код << 36);
    }
    public static string Сконвертувати(ulong команда)
    {
        var код = команда >> 36;
        var адреса1 = команда >> 24 & 0xFFF;
        var адреса2 = команда >> 12 & 0xFFF;
        var адреса3 = команда >> 0 & 0xFFF;
        var кодСтроки = Convert.ToString((int)код, 8);
        var адреса1Строки = Convert.ToString((int)адреса1, 8);
        var адреса2Строки = Convert.ToString((int)адреса2, 8);
        var адреса3Строки = Convert.ToString((int)адреса3, 8);
        return $"{("0" + кодСтроки)[^2..^0],2} {("000" + адреса1Строки)[^4..^0],4} {("000" + адреса2Строки)[^4..^0],4} {("000" + адреса3Строки)[^4..^0],4}";
    }

    public static СтруктураКоманди Розібрати(ulong команда)
    {
        var код = команда >> 36;
        var адреса1 = (команда >> 24) & (0xF_FFUL);
        var адреса2 = (команда >> 12) & (0xF_FFUL);
        var адреса3 = (команда >> 0) & (0xF_FFUL);
        return new((КодОперації)код, (int)адреса1, (int)адреса2, (int)адреса3);
    }

    private static int Розібрати8Річні(ReadOnlySpan<char> текст)
    {
        int x = 0;
        for (var i = 0; i < текст.Length; i++)
        {
            var цифра = текст[i] - '0';
            if (цифра < 0 || цифра > 7)
            {
                throw new FormatException($"Символ {текст[i]} не є 8-річною цифрою в тексті {текст}.");
            }

            x = x * 8 + цифра;
        }

        return x;
    }
}
