Repository: kant2002/KyivMachine
Catalog: Kyiv/Ресурси.*.resx
Languages: uk_ua

# ВиберітьКультуру
source: Select your locale:
uk_ua: Виберіть вашу локаль:

# ВключаєНеявнуАдресацію
source: Enable implicit addressing
uk_ua: Включає неявну адресацію

# ГенераторВипадковихЧисел
source: Random number generator
uk_ua: Генератор випадкових чисел

# Команда
source: Command
uk_ua: Команда

# Команда00
source: Empty command
uk_ua: Пуста команда

# Команда01
source: Addition
uk_ua: Додавання

# Команда02
source: Substraction
uk_ua: Віднімання

# Команда03
source: Commands addition
uk_ua: Додавання команд

# Команда04
source: Signed comparison
uk_ua: Знакове порівняння

# Команда05
source: Unsigned comparison
uk_ua: Беззнакове порівняння

# Команда06
source: Modulo substraction
uk_ua: Віднімання по модулю

# Команда07
source: Cyclic addition
uk_ua: Циклічне додавання

# Команда10
source: Multiplication without rounding
uk_ua: Множення без скруглення

# Команда11
source: Multiplication with rounding
uk_ua: Множення із скругленням

# Команда12
source: Division
uk_ua: Ділення

# Команда13
source: Logical shift
uk_ua: Логічний сдвіг

# Команда14
source: Logical addition
uk_ua: Логічне додавання

# Команда15
source: Logical multiplication
uk_ua: Логічне множення

# Команда16
source: Precision comparison
uk_ua: Точне порівняння

# Команда17
source: Equivalence
uk_ua: Рівнозначно

# Команда20
source: Entering numbers
uk_ua: Введення чисел

# Команда21
source: Entering commands
uk_ua: Введення команд

# Команда22
source: Output codes
uk_ua: Вивід кодов

# Команда23
source: Writing to reel
uk_ua: Запис на магнітний барабан

# Команда24
source: Reading from reel
uk_ua: Прочитати із магнітного барабана

# Команда25
source: Access to reel
uk_ua: Доступ до магнітного барабана

# Команда26
source: Starting group operation
uk_ua: Початок групової операції

# Команда27
source: Finish group operation
uk_ua: Кінець групової операції

# Команда30
source: Conditional jump to subroutine
uk_ua: Умовний перехід на підпрограму

# Команда31
source: Conditional jump based on sign
uk_ua: Умовний перехід по знаку

# Команда32
source: Jump based on return register
uk_ua: Перехід по регістру повернення

# Команда33
source: Stop
uk_ua: Стій машина

# Команда34
source: Jump based on fixator
uk_ua: Перехід по фіксатору

# Команда35
source: Normalization
uk_ua: Нормалізація

# Крок
source: Step
uk_ua: Крок

# МіткаАварійнаЗупинка
source: Emergency stop
uk_ua: Аварійна зупинка

# МіткаБлокировкаАварийноїЗупинки
source: Block of emergency stop
uk_ua: Блокировка аварийної зупинки

# МіткаВідоміАдреси
source: Well-known adresses
uk_ua: Відомі адреси

# МіткаПідгрузкаЗашитихПідпрограм
source: Loading wired subroutine
uk_ua: Підгрузка зашитих підпрограм

# ПідказкаПідгрузкаЗашитихПідпрограм
source: Press the button to change the current command to start a subroutine written in the ROM. You can press the Step button for step-by-step debugging.
uk_ua: Натисність на кнопку щоб змінити поточну команду на старт підпрограми, вшитої у ПЗП. Ви можете натискати кнопку Крок для покрокової відладки

# ПідказкаАварійнаЗупинка
source: Enable emergency stop during overflow in arithmetic operations
uk_ua: Включає аварійну зупинку при переповненні у аріфметичних операціях

# ПідказкаБлокировкаАварийноїЗупинки
source: Block emergency stop during overflow in arithmetic operations
uk_ua: Блокує аварійну зупинку при переповненні у аріфметичних операціях

# ПроПроект
source: About project
uk_ua: Про проект

# РегістрЗакінченняЦиклу
source: Cycle finish register
uk_ua: Регістр закінчення циклу

# РегістрЛікувальникаКоманд
source: Command counter register
uk_ua: Регістр лікувальника команд

# РегістрЛікувальнихЦиклу
source: Cycle counter register
uk_ua: Регістр лікувальних циклу

# РегістрПовернення
source: Return register
uk_ua: Регістр повернення

# РегістрПоточноїКоманди
source: Current command register
uk_ua: Регістр поточної команди

# Регистри
source: Registers
uk_ua: Регистри

# СторінкаГоловна
source: Home
uk_ua: Головна

# СторінкаДізасемблер
source: Disassembler
uk_ua: Дізасемблер

# СторінкаДекомпілятор
source: Decompiler
uk_ua: Декомпілятор

# СторінкаКоманди
source: Commands
uk_ua: Команди

# СторінкаКонстанти
source: Constants
uk_ua: Константи

# СторінкаНеточності
source: Inaccuracies
uk_ua: Неточності

# СторінкаОЗП
source: RAM
uk_ua: ОЗП

# СторінкаПЗП
source: ROM
uk_ua: ПЗП

# МіткаВивідПрінтера
source: Printer output
uk_ua: Вивід прінтера

# МіткаКод
source: Code
uk_ua: Код

# ПідказкаКод
source: Enter a set of commands
uk_ua: Введіть набір команд

# МіткаПідказка
source: Example
uk_ua: Підказка

# МіткаПідпрограми
source: Subroutines
uk_ua: Підпрограми

# ПідказкаПідпрограми
source: Built-in subroutine from non-volatile memory
uk_ua: Вбудована підпрограма із незмінної пам'яти

# ВаріантРучніАдреси
source: Manual addresses...
uk_ua: Ручні адреси ...

# Варіант2до10
source: from binary to decimal
uk_ua: из двоичной системы в десятичную

# ВаріантВиберітьПідпрограмму
source: Select subroutine ...
uk_ua: Виберіть підпрограму ...

# МіткаВідоміПідпрограмиІзКниги
source: Known subroutines from book
uk_ua: Відомі підпрограми із книги

# КнопкаЗавантажити
source: Load
uk_ua: Завантажити

# ПідказкаВиберітьПідпрограму
source: Select a subroutine to decompile from one of the drop-down lists.
uk_ua: Виберіть із одного із випадаючих списків підпрограму для декомпіляції.

# ПідказкаЗавантажити
source: Load program from ROM
uk_ua: Завантажити програму із ПЗП

# МіткаЛістінгС
source: Listing in pseudo-C
uk_ua: Лістінг у псевдо-С

# МіткаПочатковаАдреса
source: Starting address
uk_ua: Початкова адреса

# ПідказкаПочатковаАдреса
source: 8-bit number
uk_ua: 8-річне число

# МіткаКількістьСлів
source: Words count
uk_ua: Кількість слів

# МіткаЛістінгПсевдоАссемблер
source: Listing in pseudo-assembler
uk_ua: Лістінг у псевдо-асемблері

# МіткаКомірка
source: Cell
uk_ua: Комірка

# МіткаЗначення
source: Value
uk_ua: Значення

# МіткаМнемоніка
source: Mnemonic
uk_ua: Мнемоніка

# ЗаголовокСторінкиОЗП
source: Random access memory
uk_ua: Оперативний запам'ятовуючий пристрій

# ЗаголовокСторінкиПЗП
source: Passive storage device
uk_ua: Пассивний запам'ятовуючий пристрій

# МіткаКонстанти
source: Constants
uk_ua: Константи

# МіткаПостійноСпаянаПамять
source: Permanently soldered memory (PSM)
uk_ua: Постійно-спаяна пам'ять (ПСП)

# МіткаЗмінноСпаяннаПамять
source: Changeable soldered memory (CSM)
uk_ua: Змінно-спаянна пам'ять (ЗСП)

# МіткаНабірніКоди
source: Keyed codes
uk_ua: Набірні коди

# ПроРозробникаЕОМ
source: About ECM developer
uk_ua: Про розробника ЕОМ

# ПроЕОМ
source: About ECM
uk_ua: Про ЕОМ

# ПроМене
source: About me
uk_ua: Про мене
