Функціонал: Аріфметичні операції

 Структура сценарію: Додавання
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <доданок1>
  А також ячейка 18 містить команду <доданок2>
  І ячейка 100 містить команду '01 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить команду <сума>
  А також лічільник команд містить 101

  Приклади: 
	| доданок1            | доданок2            | сума                |
	| '00 0000 0000 0100' | '00 0000 0000 0300' | '00 0000 0000 0400' |

 Структура сценарію: Віднімання
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <зменшуване>
  А також ячейка 18 містить команду <від'ємник>
  І ячейка 100 містить команду '02 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить команду <різниця>
  А також лічільник команд містить 101

  Приклади: 
	| зменшуване          | від'ємник           | різниця             |
	| '00 0000 0000 0100' | '00 0000 0000 0300' | '20 0000 0000 0200' |
	| '00 0000 0000 0300' | '00 0000 0000 0100' | '00 0000 0000 0200' |
	| '20 0000 0000 0015' | '00 0000 0000 0013' | '20 0000 0000 0030' |

 Структура сценарію: Множення без скруглення
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <множник1>
  А також ячейка 18 містить команду <множник2>
  І ячейка 100 містить команду '10 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить команду <добуток>
  А також лічільник команд містить 101

  Приклади: 
	| множник1            | множник2            | добуток             |
	| '00 0001 0000 0000' | '00 0000 0020 0000' | '00 0000 0000 0001' |
	| '10 0000 0000 0000' | '10 0000 0000 0000' | '04 0000 0000 0000' |
	| '04 0000 0000 0000' | '04 0000 0000 0000' | '01 0000 0000 0000' |
	| '00 0000 0000 0012' | '00 0000 0001 0013' | '00 0000 0000 0000' |
	| '10 0000 0000 0000' | '17 7777 7777 7777' | '07 7777 7777 7777' |
#	| '17 7777 7777 7777' | '17 7777 7777 7777' | '17 7777 7777 7777' |

 Структура сценарію: Ділення
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <ділене>
  А також ячейка 18 містить команду <дільник>
  І ячейка 100 містить команду '12 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить команду <частка>
  А також лічільник команд містить 101

  Приклади: 
	| ділене              | дільник             | частка              |
	| '04 0000 0000 0000' | '10 0000 0000 0000' | '10 0000 0000 0000' |
	| '17 7777 7777 7777' | '17 7777 7777 7777' | '17 7777 7777 7777' |
	| '17 2777 7777 7777' | '17 2777 7777 7777' | '17 7777 7777 7777' |