# language: uk
Функціонал: Операція додавання

  Сценарій: Звичайне додавання
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить 100
  А також  ячейка 18 містить 300
  І ячейка 100 містить команду '01 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить 400
  А також лічільник команд містить 101

  Сценарій: Додавання із переповненням
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить максимальне позітивне число
  А також  ячейка 18 містить максимальне позітивне число
  І ячейка 100 містить команду '01 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді лічільник команд містить 102

  Сценарій: Додавання із переповненням і аварійною зупинкою
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить максимальне позітивне число
  А також  ячейка 18 містить максимальне позітивне число
  І ячейка 100 містить команду '01 0005 0022 0002'
  І регістр лічільник команд містить 100
  І аварійна зупинка включена
  Якщо виконати команді
  Тоді лічільник команд містить 102
