Функціонал: Операція ділення

  Сценарій: Звичайне ділення
  Дано пам'ять заповнена значенями 1
  І комірка 5 містить команду '04 0000 0000 0000'
  А також комірка 18 містить команду '10 0000 0000 0000'
  І комірка 100 містить команду '12 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді комірка 2 містить команду '10 0000 0000 0000'
  А також лічільник команд містить 101

  Сценарій: Ділення на машинну одиницю
  Дано пам'ять заповнена значенями 1
  І комірка 5 містить команду '17 7777 7777 7777'
  А також комірка 18 містить команду '17 7777 7777 7777'
  І комірка 100 містить команду '12 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді комірка 2 містить команду '17 7777 7777 7777'
  А також лічільник команд містить 101

  Сценарій: Ділення однакових чисел
  Дано пам'ять заповнена значенями 1
  І комірка 5 містить команду '17 2777 7777 7777'
  А також комірка 18 містить команду '17 2777 7777 7777'
  І комірка 100 містить команду '12 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді комірка 2 містить команду '17 7777 7777 7777'
  А також лічільник команд містить 101
