using Reqnroll;
using Reqnroll.UnitTestProvider;

namespace Kyiv.Tests;

[Binding]
public class КрокиМашини(IUnitTestRuntimeProvider unitTestRuntimeProvider)
{
    МашинаКиїв машина = new МашинаКиїв();

    [Given("пам'ять заповнена значенями {int}")]
    public void ДаноПамятьЗаповненаЗначенями(int число)
    {
        // 0 неможна міняти
        for (int i = 1; i < 1024; i++)
        {
            машина.ЗаписатиПамять(i, (ulong)число);
        }
    }

    [Given("комірка {int} містить {int}")]
    public void ПрипустимоКоміркаМістить(int комірка, int число)
    {
        машина.ЗаписатиПамять(комірка, ЗвузитиЧисло(число));
    }

    private static ulong ЗвузитиЧисло(long значення)
    {
        if (значення > 0) return unchecked((ulong)значення);

        return unchecked((ulong)-значення) | (1UL << 40);
    }

    [Given("комірка {int} містить максимальне позітивне число")]
    public void ПрипустимоКоміркаМіститьМаксимальнеПозітивнеЧисло(int комірка)
    {
        машина.ЗаписатиПамять(комірка, ulong.MaxValue >> 24);
    }

    [Given("комірка {int} містить мінімальне негативне число")]
    public void ПрипустимоКоміркаМіститьМінімальнеНегативнеЧисло(int комірка)
    {
        машина.ЗаписатиПамять(комірка, ulong.MaxValue >> 23);
    }

    [Given("комірка {int} містить команду {string}")]
    public void ПрипустимоКоміркаМіститьКоманду(int комірка, string команда)
    {
        машина.ЗаписатиПамять(комірка, ПарсерКоманд.Сконвертувати(команда));
    }

    [Given("регістр лічільник команд містить {int}")]
    public void ПрипустимоРегістрЛічільникКомандМістить(int комірка)
    {
        машина.РегістрС = (ushort)комірка;
        машина.РегістрК = машина.ПрочитатиПамять(машина.РегістрС);
    }

    [Given("регістр повернення містить {int}")]
    public void ПрипустимоРегістрПоверненняКомандМістить(int комірка)
    {
        машина.РегістрР = (ushort)комірка;
    }

    [Given("регістр циклу містить {int}")]
    public void ПрипустимоРегістрЦиклуМістить(int комірка)
    {
        машина.РегістрЦ = (ushort)комірка;
    }

    [Given("регістр модифікації адрес містить {int}")]
    public void ПрипустимоРегістрМодифікаціїАдресиМістить(int комірка)
    {
        машина.РегістрА = (ushort)комірка;
    }

    [Given("аварійна зупинка включена")]
    public void ПрипустимоАварійнаЗупинкаВключена()
    {
        машина.АварійнаЗупинка = true;
        unitTestRuntimeProvider.TestIgnore("Аварійна зупинка не реалізована");
    }

    [When("виконати команді")]
    public void ЯкщоВиконатиКоманді()
    {
        машина.ВиконатиКоманду();
    }

    [Then("комірка {int} містить {int}")]
    public void ТоКоміркаМістить(int комірка, int число)
    {
        Assert.Equal(ЗвузитиЧисло(число), машина.ПрочитатиПамять(комірка));
    }

    [Then("лічільник команд містить {int}")]
    public void ТоЛічільникКомандМістить(int число)
    {
        Assert.Equal((ushort)число, машина.РегістрС);
    }

    [Then("регістр повернення містить {int}")]
    public void ТоРегісітрПоверненняМістить(int число)
    {
        Assert.Equal((ushort)число, машина.РегістрР);
    }

    [Then("регістр циклу містить {int}")]
    public void ТоРегісітрЦиклуМістить(int число)
    {
        Assert.Equal((ushort)число, машина.РегістрЦ);
    }

    [Then("регістр модифікації адрес містить {int}")]
    public void ТоРегісітрМодифікаціїАдресМістить(int число)
    {
        Assert.Equal((ushort)число, машина.РегістрА);
    }

    [Then("комірка {int} містить команду {string}")]
    public void ТоКоміркаЗМіститьКоманду(int комірка, string команда)
    {
        комірка = (комірка / 1000) * 8 * 8 * 8 + (комірка % 1000 / 100) * 8 * 8 + (комірка % 100 / 10) * 8 + комірка % 10;
        Assert.Equal(команда, ПарсерКоманд.Сконвертувати(машина.ПрочитатиПамять(комірка)));
    }
}
