Функціонал: Логічні операції

 Структура сценарію: Логічне додавання
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <парам1>
  А також ячейка 18 містить команду <парам2>
  І ячейка 100 містить команду '14 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить команду <результат>
  А також лічільник команд містить 101

  Приклади: 
	| парам1              | парам2              | результат           |
	| '00 0000 0000 0000' | '37 7777 7777 7777' | '37 7777 7777 7777' |
	| '25 2525 2525 2525' | '00 0000 0000 0000' | '25 2525 2525 2525' |
	| '37 7777 7777 7777' | '37 7777 7777 7777' | '37 7777 7777 7777' |

 Структура сценарію: Логічне множення
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <парам1>
  А також ячейка 18 містить команду <парам2>
  І ячейка 100 містить команду '15 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить команду <результат>
  А також лічільник команд містить 101

  Приклади: 
	| парам1              | парам2              | результат           |
	| '37 7777 7777 7777' | '00 0000 0000 0000' | '00 0000 0000 0000' |
	| '00 0000 0000 0000' | '00 0000 0000 0000' | '00 0000 0000 0000' |
	| '00 0000 0000 0000' | '12 5252 5252 5252' | '00 0000 0000 0000' |
	| '37 7777 7777 7777' | '37 7777 7777 7777' | '37 7777 7777 7777' |

 Структура сценарію: Поразрядна однозначність
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <парам1>
  А також ячейка 18 містить команду <парам2>
  І ячейка 100 містить команду '17 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді ячейка 2 містить команду <результат>
  А також лічільник команд містить 101

  Приклади: 
	| парам1              | парам2              | результат           |
	| '25 2525 2525 2525' | '52 5252 5252 5252' | '00 0000 0000 0000' |
	| '52 5252 5252 5252' | '25 2525 2525 2525' | '00 0000 0000 0000' |
	| '52 5252 5252 5252' | '52 5252 5252 5252' | '37 7777 7777 7777' |
	| '25 2525 2525 2525' | '25 2525 2525 2525' | '37 7777 7777 7777' |
