Функціонал: Порівняння

 Структура сценарію: Порівняння без знака
  Дано пам'ять заповнена значенями 1
  І ячейка 5 містить команду <значення1>
  А також ячейка 18 містить команду <значення2>
  І ячейка 100 містить команду '05 0005 0022 0002'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді лічільник команд містить <лічільник>

  Приклади: 
	| значення1           | значення2           | лічільник  |
	| '00 0000 0000 1100' | '00 0000 0000 0300' | 101		 |
	| '00 0000 0000 0100' | '00 0000 0000 0300' | 2			 |
	| '00 0000 0000 0100' | '00 0000 0000 0100' | 2			 |
	| '00 0000 0000 0100' | '70 0000 0000 0100' | 2			 |

Сценарій: Перехід по регістру повернення
  Дано пам'ять заповнена значенями 1
  І регістр повернення містить 18
  А також ячейка 18 містить команду '05 0005 0022 0002'
  І ячейка 100 містить команду '32 0000 0000 0000'
  І регістр лічільник команд містить 100
  Якщо виконати команді
  Тоді лічільник команд містить 18
  І регістр повернення містить 0
