Функціонал: Порівняння

Структура сценарію: Порівняння без знака
	Дано пам'ять заповнена значенями 1
	І ячейка 5 містить команду <значення1>
	А також ячейка 18 містить команду <значення2>
	І ячейка 100 містить команду '05 0005 0022 0002'
	І регістр лічільник команд містить 100
	Якщо виконати команді
	Тоді лічільник команд містить <лічільник>

Приклади:
	| значення1           | значення2           | лічільник |
	| '00 0000 0000 1100' | '00 0000 0000 0300' | 101       |
	| '00 0000 0000 0100' | '00 0000 0000 0300' | 2         |
	| '00 0000 0000 0100' | '00 0000 0000 0100' | 2         |
	| '00 0000 0000 0100' | '70 0000 0000 0100' | 2         |

Сценарій: Перехід по регістру повернення
	Дано пам'ять заповнена значенями 1
	І регістр повернення містить 18
	А також ячейка 18 містить команду '05 0005 0022 0002'
	І ячейка 100 містить команду '32 0000 0000 0000'
	І регістр лічільник команд містить 100
	Якщо виконати команді
	Тоді лічільник команд містить 18
	І регістр повернення містить 0

Структура сценарію: Початок групової команди
	Дано пам'ять заповнена значенями 1
	А також ячейка 2 містить команду '32 0015 0012 0002'
	І ячейка 100 містить команду <значення1>
	І регістр лічільник команд містить 100
	Якщо виконати команді
	Тоді лічільник команд містить <лічільник>
	І регістр циклу містить 5
	І регістр модифікації адрес містить <регістр модіфікації адреси>

Приклади:
	| значення1           | регістр модіфікації адреси | лічільник |
	| '26 0005 0022 0002' | 18                         | 101       |
	| '26 0005 0005 0002' | 5                          | 2         |

Структура сценарію: Кінець групової команди
	Дано пам'ять заповнена значенями 1
	І регістр циклу містить 10
	І регістр модифікації адрес містить 5
	І ячейка 100 містить команду <значення1>
	І регістр лічільник команд містить 100
	Якщо виконати команді
	Тоді лічільник команд містить <лічільник>
	І регістр циклу містить 10
	І регістр модифікації адрес містить <регістр модіфікації адреси>

Приклади:
	| значення1           | регістр модіфікації адреси | лічільник |
	| '27 0001 0022 0002' | 6                          | 18       |
	| '27 0005 0022 0002' | 10                         | 2         |
	| '27 4001 0022 0002' | 6                          | 18       |
