namespace Kyiv.Tests;

public class ТестиМашини
{
    [Fact]
    public void Додавання()
    {
        var машина = new МашинаКиїв();
        машина.ЗаписатиПамять(100, ПарсерКоманд.Сконвертувати("01 0005 0022 0002"));
        машина.ЗаписатиПамять(5, 100);
        машина.ЗаписатиПамять(18, 300);
        машина.РегістрС = 100;
        машина.РегістрК = машина.ПрочитатиПамять(машина.РегістрС);

        машина.АварійнаЗупинка = false;
        машина.ТумблерБлокировкиАварийногоОстанова = false;

        машина.ВиконатиКоманду();

        Assert.Equal(101, машина.РегістрС);
        Assert.Equal(0UL, машина.РегістрК);
        Assert.Equal(400UL, машина.ПрочитатиПамять(2));
    }
}