namespace Kyiv.Tests;

public class ТестиКонвертера
{
    [Fact]
    public void КонвертаціяДоЧисла()
    {
        Assert.Equal(0.5, Конвертер.ДоДвойноїТочності(ПарсерКоманд.Сконвертувати("10 0000 0000 0000")));
        Assert.Equal(-0.5, Конвертер.ДоДвойноїТочності(ПарсерКоманд.Сконвертувати("30 0000 0000 0000")));
        Assert.Equal(-15.0/16.0, Конвертер.ДоДвойноїТочності(ПарсерКоманд.Сконвертувати("37 0000 0000 0000")));
        //Assert.Equal(-0.16, Конвертер.ДоДвойноїТочності(ПарсерКоманд.Сконвертувати("02 4365 6050 7534")));
    }
}